###################################################################

# Created by write_sdc on Fri May 25 10:23:43 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports clk_sys_i]  -period 4  -waveform {0 2}
create_clock [get_ports clk_phy_i]  -period 3  -waveform {0 1.5}
create_generated_clock [get_pins i_deflate/i_hyperbus/ddr_clk/clk0_o]  -name clk0  -source [get_ports clk_phy_i]  -edges {1 3 5}
create_generated_clock [get_pins i_deflate/i_hyperbus/ddr_clk/clk90_o]  -name clk90  -source [get_ports clk_phy_i]  -edges {2 4 6}
create_clock [get_ports hyper_rwds_io]  -period 6  -waveform {0 3}
set_max_delay 2  -from [list [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__2_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__3_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__4_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__5_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__6_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__7_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__8_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__9_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__10_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__11_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__12_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__13_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__14_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__15_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__16_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__17_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__18_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__19_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__20_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__21_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__22_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__23_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__24_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__25_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__26_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__27_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__28_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__29_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__30_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__31_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address_space_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst_type_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__2_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__3_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__4_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__5_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__6_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__7_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__8_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_write_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_cs__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_cs__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/data_src_q_reg_error_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/data_src_q_reg_last_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/ack_dst_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/ack_dst_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/req_src_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/req_src_q_reg]]  -to [list [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/ack_src_q_reg] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_3_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_cs__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_cs__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_write_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__8_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__7_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__6_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__5_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__4_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__3_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__2_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_burst_type_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address_space_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__31_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__30_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__29_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__28_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__27_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__26_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__25_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__24_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__23_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__22_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__21_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__20_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__19_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__18_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__17_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__16_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__15_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__14_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__13_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__12_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__11_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__10_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__9_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__8_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__7_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__6_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__5_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__4_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__3_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__2_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/data_dst_q_reg_address__1_] [get_cells i_deflate/i_hyperbus/phy_i/en_cs_reg] [get_cells i_deflate/i_hyperbus/phy_i/U242] [get_cells i_deflate/i_hyperbus/phy_i/cmd_addr_sel_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/cmd_addr_sel_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/C235] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/C232] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/I_2] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/C227] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/ack_dst_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/I_1] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/ack_src_q_reg] [get_cells i_deflate/i_hyperbus/axi2phy_i/write_state_reg_0_] [get_cells i_deflate/i_hyperbus/axi2phy_i/write_state_reg_1_] [get_cells i_deflate/i_hyperbus/axi2phy_i/U96] [get_cells i_deflate/i_hyperbus/axi2phy_i/C551] [get_cells i_deflate/i_hyperbus/axi2phy_i/U102] [get_cells i_deflate/i_hyperbus/axi2phy_i/U98] [get_cells i_deflate/i_hyperbus/axi2phy_i/U101] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/data_dst_q_reg_error_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/data_dst_q_reg_last_] [get_cells i_deflate/i_hyperbus/axi2phy_i/U97] [get_cells i_deflate/i_hyperbus/axi2phy_i/B_7] [get_cells i_deflate/i_hyperbus/axi2phy_i/U99] [get_cells i_deflate/i_hyperbus/axi2phy_i/I_13] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/C59] [get_cells i_deflate/i_hyperbus/axi2phy_i/C560] [get_cells i_deflate/i_hyperbus/axi2phy_i/C562] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/C56] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/I_2] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/C51] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/ack_dst_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/I_1] [get_cells i_deflate/i_hyperbus/axi2phy_i/decode_error_reg] [get_cells i_deflate/i_hyperbus/axi2phy_i/trans_state_reg_0_] [get_cells i_deflate/i_hyperbus/axi2phy_i/trans_state_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_cs__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_cs__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_write_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__8_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__7_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__6_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__5_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__4_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__3_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__2_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst__0_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_burst_type_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address_space_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__31_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__30_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__29_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__28_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__27_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__26_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__25_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__24_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__23_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__22_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__21_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__20_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__19_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__18_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__17_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__16_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__15_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__14_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__13_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__12_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__11_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__10_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__9_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__8_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__7_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__6_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__5_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__4_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__3_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__2_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__1_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/data_src_q_reg_address__0_] [get_cells i_deflate/i_hyperbus/axi2phy_i/C517] [get_cells i_deflate/i_hyperbus/axi2phy_i/I_22] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/C218] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/I_0] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/C213] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/req_src_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_src/I_2] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_trans_signals/i_dst/req_dst_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/data_src_q_reg_last_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/data_src_q_reg_error_] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/C42] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/I_0] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/C37] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/req_src_q_reg] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_src/I_2] [get_cells i_deflate/i_hyperbus/i_cdc_2phase_b_resp/i_dst/req_dst_q_reg]]
set_max_delay 2  -from [list [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_2_]]  -to [list [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C819] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_dst_g2b/C9] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_dst_g2b/C10] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_dst_g2b/C11] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C818] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_dst_g2b/C12] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_dst_g2b/C13] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C817] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_dst_g2b/C14] [get_cells i_deflate/i_hyperbus/phy_i/U246] [get_cells i_deflate/i_hyperbus/phy_i/C1603] [get_cells i_deflate/i_hyperbus/phy_i/C1604] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__1_] [get_cells i_deflate/i_hyperbus/phy_i/C1600] [get_cells i_deflate/i_hyperbus/phy_i/C1613] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C471] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C473] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C475] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C477] [get_cells i_deflate/i_hyperbus/phy_i/C1511] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C479] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C490] [get_cells i_deflate/i_hyperbus/phy_i/C1496] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/C1497] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C810] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C777] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C776] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C775] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C816] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_wptr_gray_q2_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_wptr_gray_q2_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_wptr_gray_q2_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_wptr_gray_q2_reg_3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C489] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/i_dst_g2b/C8] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/i_dst_g2b/C9] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C488] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/i_dst_g2b/C10] [get_cells i_deflate/i_hyperbus/phy_i/en_cs_reg] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_8_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_7_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_6_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_5_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_4_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/I_56] [get_cells i_deflate/i_hyperbus/phy_i/U235] [get_cells i_deflate/i_hyperbus/phy_i/U236] [get_cells i_deflate/i_hyperbus/phy_i/C1640] [get_cells i_deflate/i_hyperbus/phy_i/C1609] [get_cells i_deflate/i_hyperbus/phy_i/C1637] [get_cells i_deflate/i_hyperbus/phy_i/U241] [get_cells i_deflate/i_hyperbus/phy_i/C1629] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/write_valid_reg] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/write_strb_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/write_strb_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_15_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_14_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_13_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_12_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_11_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_10_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_9_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_8_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_7_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_6_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_5_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_4_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/C1606] [get_cells i_deflate/i_hyperbus/phy_i/C1639] [get_cells i_deflate/i_hyperbus/phy_i/U242] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/C1485] [get_cells i_deflate/i_hyperbus/phy_i/I_58] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C482] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C459] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C458] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C487] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_wptr_gray_q2_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_wptr_gray_q2_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_wptr_gray_q2_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C489] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/i_dst_g2b/C8] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/i_dst_g2b/C9] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C488] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/i_dst_g2b/C10] [get_cells i_deflate/i_hyperbus/axi2phy_i/read_state_reg_0_] [get_cells i_deflate/i_hyperbus/axi2phy_i/read_state_reg_1_] [get_cells i_deflate/i_hyperbus/axi2phy_i/U104] [get_cells i_deflate/i_hyperbus/axi2phy_i/I_18] [get_cells i_deflate/i_hyperbus/axi2phy_i/U103] [get_cells i_deflate/i_hyperbus/axi2phy_i/C583] [get_cells i_deflate/i_hyperbus/axi2phy_i/C590] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/axi2phy_i/C569] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C482] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C459] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C458] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C487] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_wptr_gray_q2_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_wptr_gray_q2_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_wptr_gray_q2_reg_2_]]
set_max_delay 2  -from [list [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/dst_rptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/dst_rptr_gray_q_reg_2_]]  -to [list [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C815] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_src_g2b/C9] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_src_g2b/C10] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_src_g2b/C11] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C814] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_src_g2b/C12] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_src_g2b/C13] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C813] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/i_src_g2b/C14] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_bin_q_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_wptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C790] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C793] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C795] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C797] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C799] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C801] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C803] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C805] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C807] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C820] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C783] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C782] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C781] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/I_10] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C812] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_rptr_gray_q2_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_rptr_gray_q2_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_rptr_gray_q2_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/src_rptr_gray_q2_reg_3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C486] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/i_src_g2b/C8] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/i_src_g2b/C9] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C485] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/i_src_g2b/C10] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_wptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C471] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C473] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C475] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C477] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C479] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C490] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C464] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C463] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/I_5] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/C484] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_rptr_gray_q2_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_rptr_gray_q2_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/src_rptr_gray_q2_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C486] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/i_src_g2b/C8] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/i_src_g2b/C9] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C485] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/i_src_g2b/C10] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/dst_rptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/U246] [get_cells i_deflate/i_hyperbus/phy_i/C1603] [get_cells i_deflate/i_hyperbus/phy_i/C1604] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_8_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_7_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_6_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_5_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_4_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/burst_cnt_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/C810] [get_cells i_deflate/i_hyperbus/phy_i/C1600] [get_cells i_deflate/i_hyperbus/phy_i/C1613] [get_cells i_deflate/i_hyperbus/phy_i/B_17] [get_cells i_deflate/i_hyperbus/phy_i/U237] [get_cells i_deflate/i_hyperbus/phy_i/U242] [get_cells i_deflate/i_hyperbus/phy_i/C1628] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_bin_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_gray_q_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_bin_q_reg_2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_wptr_bin_q_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C471] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C473] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C475] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C477] [get_cells i_deflate/i_hyperbus/phy_i/C1495] [get_cells i_deflate/i_hyperbus/phy_i/C1511] [get_cells i_deflate/i_hyperbus/phy_i/I_57] [get_cells i_deflate/i_hyperbus/phy_i/B_19] [get_cells i_deflate/i_hyperbus/phy_i/C1626] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C479] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C490] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C464] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C463] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/I_5] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/C484] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_rptr_gray_q2_reg_0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_rptr_gray_q2_reg_1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/src_rptr_gray_q2_reg_2_]]
set_false_path   -from [list [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_7__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_6__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_5__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_4__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_3__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_2__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_1__15_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__0_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__1_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__2_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__3_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__4_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__5_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__6_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__7_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__8_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__9_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__10_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__11_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__12_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__13_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__14_] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/i_cdc_fifo_hyper/fifo_data_q_reg_0__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_3__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_2__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_1__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__strb__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__strb__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_TX_fifo/fifo_data_q_reg_0__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__last_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__error_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__last_]]  -to [list [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__0_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__1_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__2_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__3_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__4_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__5_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__6_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__7_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__8_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__9_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__10_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__11_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__12_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__13_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__14_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_0__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_1__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_2__data__15_] [get_cells i_deflate/i_hyperbus/i_cdc_RX_fifo/fifo_data_q_reg_3__data__15_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_4_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_5_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_6_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_7_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_8_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_9_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_10_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_11_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_12_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_13_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_14_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_15_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_16_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_17_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_18_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_19_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_20_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_21_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_22_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_23_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_24_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_25_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_26_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_27_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_28_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_29_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_30_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_reg_31_] [get_cells i_deflate/i_hyperbus/phy_i/local_address_space_reg] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_type_reg] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_4_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_5_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_6_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_7_] [get_cells i_deflate/i_hyperbus/phy_i/local_burst_reg_8_] [get_cells i_deflate/i_hyperbus/phy_i/local_write_reg] [get_cells i_deflate/i_hyperbus/phy_i/local_cs_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/local_cs_reg_1_] [get_cells i_deflate/i_hyperbus/axi2phy_i/U101] [get_cells i_deflate/i_hyperbus/axi2phy_i/B_7] [get_cells i_deflate/i_hyperbus/axi2phy_i/U99] [get_cells i_deflate/i_hyperbus/axi2phy_i/I_13] [get_cells i_deflate/i_hyperbus/axi2phy_i/C562] [get_cells i_deflate/i_hyperbus/axi2phy_i/write_state_reg_0_] [get_cells i_deflate/i_hyperbus/axi2phy_i/write_state_reg_1_] [get_cells i_deflate/i_hyperbus/axi2phy_i/U96] [get_cells i_deflate/i_hyperbus/axi2phy_i/C551] [get_cells i_deflate/i_hyperbus/axi2phy_i/U102] [get_cells i_deflate/i_hyperbus/axi2phy_i/U98] [get_cells i_deflate/i_hyperbus/axi2phy_i/U97] [get_cells i_deflate/i_hyperbus/axi2phy_i/C560] [get_cells i_deflate/i_hyperbus/phy_i/write_strb_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/write_strb_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_4_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_5_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_6_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_7_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_8_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_9_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_10_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_11_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_12_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_13_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_14_] [get_cells i_deflate/i_hyperbus/phy_i/write_data_reg_15_] [get_cells i_deflate/i_hyperbus/axi2phy_i/B_12] [get_cells i_deflate/i_hyperbus/axi2phy_i/U108] [get_cells i_deflate/i_hyperbus/axi2phy_i/U106] [get_cells i_deflate/i_hyperbus/axi2phy_i/I_20] [get_cells i_deflate/i_hyperbus/axi2phy_i/read_state_reg_0_] [get_cells i_deflate/i_hyperbus/axi2phy_i/read_state_reg_1_] [get_cells i_deflate/i_hyperbus/axi2phy_i/U104] [get_cells i_deflate/i_hyperbus/axi2phy_i/I_18] [get_cells i_deflate/i_hyperbus/axi2phy_i/U103] [get_cells i_deflate/i_hyperbus/axi2phy_i/C583] [get_cells i_deflate/i_hyperbus/axi2phy_i/C590] [get_cells i_deflate/i_hyperbus/axi2phy_i/C569] [get_cells i_deflate/i_hyperbus/axi2phy_i/C570]]
set_max_delay 4  -from [list [get_cells i_deflate/i_hyperbus/phy_i/read_clk_en_reg] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__0_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__1_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__2_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__3_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__4_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__5_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__6_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__7_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__8_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__9_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__10_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__11_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__12_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__13_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__14_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__15_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__16_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__17_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__18_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__19_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__20_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__21_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__22_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__23_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__24_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__25_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__26_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__27_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__28_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__29_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__30_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_4__31_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__0_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__1_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__2_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__3_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__4_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__5_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__6_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__7_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__8_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__9_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__10_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__11_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__12_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__13_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__14_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__15_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__16_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__17_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__18_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__19_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__20_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__21_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__22_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__23_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__24_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__25_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__26_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__27_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__28_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__29_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__30_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_3__31_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__0_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__1_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__2_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__3_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__4_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__5_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__6_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__7_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__8_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__9_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__10_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__11_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__12_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__13_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__14_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__15_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__16_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__17_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__18_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__19_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__20_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__21_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__22_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__23_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__24_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__25_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__26_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__27_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__28_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__29_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__30_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_2__31_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__0_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__1_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__2_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__3_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__4_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__5_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__6_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__7_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__8_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__9_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__10_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__11_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__12_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__13_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__14_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__15_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__16_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__17_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__18_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__19_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__20_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__21_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__22_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__23_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__24_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__25_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__26_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__27_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__28_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__29_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__30_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_1__31_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__0_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__1_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__2_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__3_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__4_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__5_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__6_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__7_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__8_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__9_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__10_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__11_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__12_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__13_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__14_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__15_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__16_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__17_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__18_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__19_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__20_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__21_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__22_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__23_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__24_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__25_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__26_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__27_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__28_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__29_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__30_] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/reg_q_reg_0__31_]]  -to [list [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/read_in_valid_reg] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/C15] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/I_1] [get_cells i_deflate/i_hyperbus/phy_i/i_read_clk_rwds/cdc_read_ck_gating/clk_gate_i] [get_cells i_deflate/i_hyperbus/phy_i/U228] [get_cells i_deflate/i_hyperbus/phy_i/U241] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_4_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_5_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_6_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_7_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_8_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_9_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_10_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_11_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_12_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_13_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_14_] [get_cells i_deflate/i_hyperbus/phy_i/cs_max_reg_15_] [get_cells i_deflate/i_hyperbus/phy_i/U262] [get_cells i_deflate/i_hyperbus/phy_i/U232] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/wait_cnt_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/U220] [get_cells i_deflate/i_hyperbus/phy_i/U224] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/U501] [get_cells i_deflate/i_hyperbus/config_registers_i/registers/U469] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_1_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_2_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_3_] [get_cells i_deflate/i_hyperbus/phy_i/hyper_trans_state_reg_0_] [get_cells i_deflate/i_hyperbus/phy_i/U242] [get_cells i_deflate/i_hyperbus/phy_i/U246] [get_cells i_deflate/i_hyperbus/phy_i/U233] [get_cells i_deflate/i_hyperbus/phy_i/U234] [get_cells i_deflate/i_hyperbus/phy_i/B_13] [get_cells i_deflate/i_hyperbus/phy_i/I_51]]
set_max_delay 3  -from [list [get_pins i_deflate/i_hyperbus/phy_i/hyper_dq_oe_o_reg/Q] [get_pins i_deflate/i_hyperbus/phy_i/hyper_rwds_oe_o_reg/Q]]  -to [list [get_ports {hyper_dq_io[7]}] [get_ports {hyper_dq_io[6]}] [get_ports {hyper_dq_io[5]}] [get_ports {hyper_dq_io[4]}] [get_ports {hyper_dq_io[3]}] [get_ports {hyper_dq_io[2]}] [get_ports {hyper_dq_io[1]}] [get_ports {hyper_dq_io[0]}] [get_ports hyper_rwds_io]]
set_max_delay 2  -from [get_pins i_deflate/i_hyperbus/hyper_rwds_i]  -to [get_pins i_deflate/i_hyperbus/phy_i/hyper_rwds_i_syn_reg/D]
set_false_path -hold   -from [get_clocks hyper_rwds_io]  -to [get_clocks clk0]
set_false_path -hold   -from [get_clocks clk0]  -to [get_clocks clk_sys_i]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[31]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[30]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[29]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[28]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[27]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[26]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[25]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[24]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[23]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[22]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[21]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[20]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[19]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[18]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[17]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[16]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[15]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[14]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[13]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[12]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[11]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[10]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[9]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[8]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_addr[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports cfg_i_write]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[31]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[30]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[29]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[28]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[27]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[26]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[25]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[24]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[23]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[22]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[21]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[20]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[19]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[18]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[17]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[16]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[15]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[14]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[13]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[12]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[11]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[10]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[9]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[8]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wdata[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wstrb[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wstrb[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wstrb[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_wstrb[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports cfg_i_valid]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[9]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[8]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_id[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[31]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[30]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[29]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[28]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[27]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[26]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[25]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[24]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[23]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[22]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[21]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[20]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[19]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[18]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[17]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[16]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[15]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[14]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[13]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[12]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[11]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[10]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[9]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[8]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_addr[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_len[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_size[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_size[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_size[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_burst[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_burst[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_aw_lock]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_cache[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_cache[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_cache[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_cache[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_prot[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_prot[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_prot[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_qos[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_qos[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_qos[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_qos[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_region[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_region[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_region[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_region[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_aw_user[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_aw_valid]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[15]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[14]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[13]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[12]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[11]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[10]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[9]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[8]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_data[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_strb[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_strb[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_w_last]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_w_user[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_w_valid]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[9]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[8]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_id[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[31]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[30]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[29]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[28]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[27]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[26]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[25]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[24]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[23]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[22]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[21]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[20]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[19]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[18]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[17]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[16]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[15]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[14]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[13]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[12]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[11]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[10]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[9]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[8]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_addr[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[7]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[6]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[5]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[4]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_len[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_size[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_size[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_size[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_burst[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_burst[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_ar_lock]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_cache[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_cache[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_cache[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_cache[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_prot[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_prot[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_prot[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_qos[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_qos[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_qos[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_qos[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_region[3]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_region[2]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_region[1]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_region[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {axi_i_ar_user[0]}]
set_input_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_ar_valid]
set_input_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports axi_i_b_ready]
set_input_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports axi_i_r_ready]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[31]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[30]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[29]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[28]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[27]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[26]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[25]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[24]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[23]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[22]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[21]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[20]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[19]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[18]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[17]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[16]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[15]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[14]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[13]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[12]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[11]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[10]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[9]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[8]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[7]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[6]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[5]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[4]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[3]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[2]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[1]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports {cfg_i_rdata[0]}]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports cfg_i_error]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports cfg_i_ready]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_aw_ready]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_w_ready]
set_output_delay -clock clk_sys_i  1.33333  -source_latency_included  [get_ports axi_i_ar_ready]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[9]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[8]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[7]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[6]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[5]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[4]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[3]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[2]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[1]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_id[0]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_resp[1]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_resp[0]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_b_user[0]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports axi_i_b_valid]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[9]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[8]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[7]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[6]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[5]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[4]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[3]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[2]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[1]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_id[0]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[15]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[14]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[13]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[12]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[11]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[10]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[9]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[8]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[7]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[6]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[5]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[4]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[3]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[2]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[1]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_data[0]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_resp[1]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_resp[0]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports axi_i_r_last]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports {axi_i_r_user[0]}]
set_output_delay -clock clk_sys_i  2.66667  -source_latency_included  [get_ports axi_i_r_valid]
